In [ ]:
import pandas as pd

In [ ]:
# creating a dataframe from a dictionary
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["New York", "Los Angeles", "Chicago"]
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [10]:
print("\n######### Name column:")
print(df["Name"])
print("\n######### Name and City columns:")
print(df[["Name", "City"]])
# Accesing rows using occnditional selection
print("\n######### Rows where Age > 30:")
print(df[df["Age"] > 30])

# turn into csv
df.to_csv("data.csv", index=False)

######### Name column:
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

######### Name and City columns:
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

######### Rows where Age > 30:
      Name  Age     City
2  Charlie   35  Chicago

In [ ]:
df = pd.read_csv("data.csv", index_col=False)
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [13]:
import seaborn as sns

In [14]:
iris_df = sns.load_dataset("iris")
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
# Basic statistics
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [16]:
iris_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [18]:
grades = {
    "Student": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Math": [85, 90, 78, 92, 88],
    "Science": [92, 88, 80, 85, 90],
    "English": [88, 91, 85, 87, 89]
}
df = pd.DataFrame(grades)
df.to_csv("grades.csv", index=False)

In [ ]:
# calculate average grade for each student
df["Average"] = df[["Math", "Science", "English"]].mean(axis=1) # axis = 1 => por columnas
df

   Student  Math  Science  English    Average
0    Alice    85       92       88  88.333333
1      Bob    90       88       91  89.666667
2  Charlie    78       80       85  81.000000
3    David    92       85       87  88.000000
4      Eve    88       90       89  89.000000

In [20]:
iris_df.groupby("species")["sepal_length"].mean()

species
setosa        5.006
versicolor    5.936
virginica     6.588
Name: sepal_length, dtype: float64

In [21]:
iris_df.groupby("species")[["sepal_length","sepal_width"]].mean()

            sepal_length  sepal_width
species
setosa             5.006        3.428
versicolor         5.936        2.770
virginica          6.588        2.974

# Ejercicio
- Calcular salario promedio del departamento
- Filtrar empleados con un salario mayor al promedio
- Guardar resultado en un csv

In [30]:
# Create a dataset of employees
employees = {
    "Employee": ["John", "Jane", "Jim", "Jill", "Jack", "Jenny", "Joe", "Jessica", "James", "Julia"],
    "Department": ["HR", "Finance", "IT", "Marketing", "Sales", "HR", "Finance", "IT", "Marketing", "Sales"],
    "Salary": [50000, 60000, 55000, 70000, 65000, 52000, 61000, 56000, 71000, 66000]
}
df = pd.DataFrame(employees)

In [31]:
df["Average_Salary_Department"] = df.groupby("Department")["Salary"].transform("mean")

In [33]:
# filtrar empleados con salario por encima del promedio de su departamento
df[df["Salary"] > df["Average_Salary_Department"]]

  Employee Department  Salary  Average_Salary_Department
5    Jenny         HR   52000                    51000.0
6      Joe    Finance   61000                    60500.0
7  Jessica         IT   56000                    55500.0
8    James  Marketing   71000                    70500.0
9    Julia      Sales   66000                    65500.0

In [34]:
# guardar el dataframe en un csv
df[df["Salary"] > df["Average_Salary_Department"]].to_csv("high_salary_employees.csv", index=False)